Процедура ЗаписатьПереносИзПриложения(ОписаниеПереноса) Экспорт

	НовыйПеренос = Документы.Перенос.СоздатьДокумент();
	НовыйПеренос.Дата = ОписаниеПереноса.Дата;
    НовыйПеренос.Проведен = (ОписаниеПереноса.Проведен = "Да" Или ОписаниеПереноса.Проведен = "Истина");
	НовыйПеренос.СкладОтправитель = Справочники.СкладМатериалов.НайтиПоНаименованию(ОписаниеПереноса.СкладОтправитель);
	НовыйПеренос.СкладПриниматель = Справочники.СкладМатериалов.НайтиПоНаименованию(ОписаниеПереноса.СкладПриниматель);
	
	Для Каждого ПереносаИзМассива Из ОписаниеПереноса.Перенос Цикл
        СтрокаПереноса = НовыйПеренос.Перенос.Добавить();
        СтрокаПереноса.Материал = Справочники.Номенклатура.НайтиПоНаименованию(ПереносаИзМассива.Материал);
        СтрокаПереноса.Количество = Число(ПереносаИзМассива.Количество);
	КонецЦикла;
	
	Попытка
        НовыйПеренос.Записать();
        Сообщить("Записалось!");
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
	

КонецПроцедуры
