
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ЭтотОбъект.Статус = Перечисления.СтатусЭтапаПроизводства.Завершен Тогда
		// регистр СкладМатериалов Расход
		Движения.СкладМатериалов.Записывать = Истина;
		Для Каждого ТекСтрокаЗатраченныеМатериалы Из ЗатраченныеМатериалы Цикл
			Движение = Движения.СкладМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаЗатраченныеМатериалы.ЗатраченныеМатериалы;
			Движение.Склад = ТекСтрокаЗатраченныеМатериалы.Склад;
			Движение.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
		КонецЦикла;
		
		// регистр СкладГотовойПродукции Приход
		Движения.СкладГотовойПродукции.Записывать = Истина;
		Движение = Движения.СкладГотовойПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Количество;
		Движения.Записать();
		
		// регистр ВыпускГотовойПродукции Приход
		Движения.ВыпускГотовойПродукции.Записывать = Истина;
		Движение = Движения.ВыпускГотовойПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.Количество = Количество;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладМатериаловОстатки.Номенклатура КАК Номенклатура,
		|	СкладМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.СкладМатериалов.Остатки(, Номенклатура В (&МассивНоменклатура)) КАК СкладМатериаловОстатки
		|ГДЕ
		|	СкладМатериаловОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("МассивНоменклатура", ЗатраченныеМатериалы.ВыгрузитьКолонку("ЗатраченныеМатериалы"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		//Если НЕ РезультатЗапроса.Пустой() Тогда
		//	Отказ = Истина;
		//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		Сообщить("Не хватает материалов " + ВыборкаДетальныеЗаписи.Номенклатура + ", в количестве " + (- ВыборкаДетальныеЗаписи.КоличествоОстаток));
		//	КонецЦикла;
		//КонецЕсли;
	КонецЕсли;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаСписокИзделий Из ДанныеЗаполнения.СписокИзделий Цикл
			НоваяСтрока = ЗатраченныеМатериалы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаСписокИзделий.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаСписокИзделий.Количество;
			НоваяСтрока.ЗатраченныеМатериалы = ТекСтрокаСписокИзделий.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры





