
Функция НоменклатураПолучитьНоменклатуру(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ОбщийСерверныйМодуль.ПолучитьНоменклатуруДляПриложения());
	Возврат Ответ;
КонецФункции

Функция БригадаПолучитьБригаду(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ОбщийСерверныйМодуль.ПолучитьБригадуДляПриложения());
	Возврат Ответ;
КонецФункции

Функция ЭтапыПолучитьЭтапы(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ОбщийСерверныйМодуль.ПолучитьЭтапыДляПриложения());
	Возврат Ответ;
КонецФункции

Функция ЭтапыЗаписатьЭтапы(Запрос)
    ОбщийСерверныйМодуль.ЗаписатьЭтапыИзПриложения(Запрос.ПолучитьТелоКакСтроку());
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция ПереносЗаписатьПеренос(Запрос)
	ОбщийСерверныйМодуль.ЗаписатьПереносИзПриложения(Запрос.ПолучитьТелоКакСтроку());
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция БракЗаписатьБрак(Запрос)
	ОбщийСерверныйМодуль.ЗаписатьБракИзПриложения(Запрос.ПолучитьТелоКакСтроку());
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
