Процедура ЗаписатьЭтапыИзПриложения(ОписаниеЭтапов) Экспорт 
    
    НовыйЭтап = Документы.ВыполениеЭтапаПроизводства.СоздатьДокумент();
    
    // Шапка
    НовыйЭтап.Дата = ОписаниеЭтапов.Дата;
    НовыйЭтап.Проведен = (ОписаниеЭтапов.Проведен = "Да" Или ОписаниеЭтапов.Проведен = "Истина");
    НовыйЭтап.Заказ = Документы.Заказ.НайтиПоНомеру(ОписаниеЭтапов.Заказ);
    НовыйЭтап.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ОписаниеЭтапов.Номенклатура);
    НовыйЭтап.Склад = Справочники.СкладГотовойПродукции.НайтиПоНаименованию(ОписаниеЭтапов.Склад);
    НовыйЭтап.Количество = Число(ОписаниеЭтапов.Количество);
	НовыйЭтап.Статус = Перечисления.СтатусЭтапаПроизводства[ОписаниеЭтапов.Статус];
    
    // Затраченные материалы
    Для Каждого МатериалИзМассива Из ОписаниеЭтапов.ЗатраченныеМатериалы Цикл
        СтрокаМатериала = НовыйЭтап.ЗатраченныеМатериалы.Добавить();
        СтрокаМатериала.Склад = Справочники.СкладМатериалов.НайтиПоНаименованию(МатериалИзМассива.Склад);
        СтрокаМатериала.ЗатраченныеМатериалы = Справочники.Номенклатура.НайтиПоНаименованию(МатериалИзМассива.Материал);
        СтрокаМатериала.ЕдиницаИзмерения = Перечисления.ЕдиницаИзмерения[МатериалИзМассива.ЕдиницаИзмерения];
        СтрокаМатериала.Количество = Число(МатериалИзМассива.Количество);
    КонецЦикла;
    
    // Трудозатраты
    Для Каждого ТрудозатратаИзМассива Из ОписаниеЭтапов.Трудозатраты Цикл
        СтрокаТрудозатрат = НовыйЭтап.Трудозатраты.Добавить();
        СтрокаТрудозатрат.ВидРаботы = Справочники.СтоимостьЧаса.НайтиПоНаименованию(ТрудозатратаИзМассива.ВидРаботы);
        СтрокаТрудозатрат.Время = Число(ТрудозатратаИзМассива.Время);
        СтрокаТрудозатрат.Бригада = Справочники.Рабочая_бригада.НайтиПоНаименованию(ТрудозатратаИзМассива.Бригада);
    КонецЦикла;
    
        Попытка
        НовыйЭтап.Записать();
        Сообщить("Записалось!");
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры