
&НаКлиенте
Процедура РеализацияКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Реализация.ТекущиеДанные;      
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура РеализацияЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Реализация.ТекущиеДанные;      
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура РеализацияГотоваяПродукцияПриИзменении(Элемент)
    
    ТекущаяСтрока = Элементы.Реализация.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
  
    Если ЗначениеЗаполнено(ТекущаяСтрока.ГотоваяПродукция) Тогда
      
        ИндексСтроки = Элементы.Реализация.ТекущаяСтрока;
        
       
        ЗаполнитьАртикулНаСервере(ИндексСтроки, ТекущаяСтрока.ГотоваяПродукция);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАртикулНаСервере(ИндексСтроки, ГотоваяПродукция)
 
    НоменклатураОбъект = ГотоваяПродукция.ПолучитьОбъект();
    
    Если НоменклатураОбъект = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
  
    СтрокаТаблицы = Объект.Реализация[ИндексСтроки];
    
 
    СтрокаТаблицы.Артикул = НоменклатураОбъект.Код;
КонецПроцедуры