
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		// Заполнение шапки
		ЗаказНаПроизводство = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокИзделий Из ДанныеЗаполнения.СписокИзделий Цикл
			НоваяСтрока = СписокИзделий.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокИзделий.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокИзделий.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
