
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияДок.Дата,
	|	РеализацияДок.Номер,
	|	РеализацияДок.Покупатель,
	|	РеализацияДок.Склад,
	|	РеализацияДок.Реализация.(
	|		НомерСтроки,
	|		Артикул,
	|		ГотоваяПродукция,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК РеализацияДок
	|ГДЕ
	|	РеализацияДок.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьКартинки = Макет.ПолучитьОбласть("Картинка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРеализацияШапка = Макет.ПолучитьОбласть("РеализацияШапка");
	ОбластьРеализация = Макет.ПолучитьОбласть("Реализация");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьКартинки);
		
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРеализацияШапка);
		ВыборкаРеализация = Выборка.Реализация.Выбрать();
		Пока ВыборкаРеализация.Следующий() Цикл
			ОбластьРеализация.Параметры.Заполнить(ВыборкаРеализация);
			ТабДок.Вывести(ОбластьРеализация, ВыборкаРеализация.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
