
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНовостиССервера();
КонецПроцедуры

 &НаСервере
Процедура ОбновитьНовостиССервера()
	Попытка
		АдресСервера = "192.168.0.150:8080"; 
		СтрокаЗапроса = "/WEB/hs/services/uta";
		Соединение = Новый HTTPСоединение(АдресСервера);
		
		ЗапросПолучения = Новый HTTPЗапрос(СтрокаЗапроса);
		
		Ответ = Соединение.Получить(ЗапросПолучения); 
		
		Если Ответ.КодСостояния = 200 Тогда
			МассивЭтап = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
			
			Выборка = Документы.ВыполениеЭтапаПроизводства.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектДокумента = Выборка.ПолучитьОбъект();
				ОбъектДокумента.Удалить();
			КонецЦикла;
			
			Для каждого ЭтапыИзМассива Из МассивЭтап Цикл
				НовыйЭтап = Документы.ВыполениеЭтапаПроизводства.СоздатьДокумент();
				
				НовыйЭтап.Дата = Дата(ЭтапыИзМассива.Дата);
				НовыйЭтап.Проведен = ЭтапыИзМассива.Проведен;
				НовыйЭтап.Заказ = Документы.Заказ.НайтиПоНомеру(ЭтапыИзМассива.Заказ);
				НовыйЭтап.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ЭтапыИзМассива.Номенклатура).Ссылка;
				НовыйЭтап.Склад = Справочники.СкладГотовойПродукции.НайтиПоНаименованию(ЭтапыИзМассива.Склад).Ссылка;
				НовыйЭтап.Количество = ЭтапыИзМассива.Количество;
				НовыйЭтап.Статус = Перечисления.СтатусЭтапаПроизводства[ЭтапыИзМассива.Статус];
				
				МассивМатериалов = ЭтапыИзМассива.ЗатраченныеМатериалы;
				Для Каждого МатериалИзМассива Из МассивМатериалов Цикл
					СтрокаМатериала = НовыйЭтап.ЗатраченныеМатериалы.Добавить();
					СтрокаМатериала.Склад = Справочники.СкладМатериалов.НайтиПоНаименованию(МатериалИзМассива.Склад).Ссылка;
					СтрокаМатериала.ЗатраченныеМатериалы = Справочники.Номенклатура.НайтиПоНаименованию(МатериалИзМассива.Материал).Ссылка;
					СтрокаМатериала.ЕдиницаИзмерения = Перечисления.ЕдиницаИзмерения[МатериалИзМассива.ЕдиницаИзмерения];
					СтрокаМатериала.Количество = МатериалИзМассива.Количество;
				КонецЦикла;
				
				МассивТрудозатрат = ЭтапыИзМассива.Трудозатраты;
				Для Каждого ТрудозатратаИзМассива Из МассивТрудозатрат Цикл
					СтрокаТрудозатрат = НовыйЭтап.Трудозатраты.Добавить();
					СтрокаТрудозатрат.ВидРаботы = Справочники.СтоимостьЧаса.НайтиПоНаименованию(ТрудозатратаИзМассива.ВидРаботы).Ссылка;
					СтрокаТрудозатрат.Время = ТрудозатратаИзМассива.Время;
					СтрокаТрудозатрат.Бригада = Справочники.Рабочая_бригада.НайтиПоНаименованию(ТрудозатратаИзМассива.Бригада).Ссылка;
				КонецЦикла;
				
				НовыйЭтап.Записать();
				
			КонецЦикла;
			
        Иначе
            Сообщить("Ошибка на стороне сервера: " + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;
    Исключение
        Сообщить("Ошибка соединения: " + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;       
	   
КонецПроцедуры


&НаКлиенте
Процедура ФильтрЗавершен(Команда)
    Список.Отбор.Элементы.Очистить();
    Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.СтатусЭтапаПроизводства.Завершен");
    Отбор.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВРаботе(Команда)
    Список.Отбор.Элементы.Очистить();
    Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.СтатусЭтапаПроизводства.ВРаботе");
	Отбор.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗапланирован(Команда)
    Список.Отбор.Элементы.Очистить();
    Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
    Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Отбор.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.СтатусЭтапаПроизводства.Запланирован");
    Отбор.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВсе(Команда)
    Список.Отбор.Элементы.Очистить();
КонецПроцедуры