Функция ОтправкаОстатокСырья() Экспорт
	Возврат ЗаписатьЗначениеJSON(ПолучитьОстаткиСырьяМассивом());
КонецФункции


Функция ПолучитьОстаткиСырьяМассивом()

	МассивСырья = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладМатериаловОстатки.Номенклатура КАК Номенклатура,
		|	СкладМатериаловОстатки.Склад КАК Склад,
		|	СкладМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.СкладМатериалов.Остатки КАК СкладМатериаловОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстаткиСырья = Новый Структура("Номенклатура, Склад, КоличествоОстаток");
		ЗаполнитьЗначенияСвойств(ОстаткиСырья, ВыборкаДетальныеЗаписи);
		ОстаткиСырья.Номенклатура = Строка(ОстаткиСырья.Номенклатура);
		ОстаткиСырья.Склад = Строка(ОстаткиСырья.Склад);
		МассивСырья.Добавить(ОстаткиСырья);	
	КонецЦикла;
	
	Возврат МассивСырья;

КонецФункции 