

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СкладМатериалов Приход
	Движения.СкладМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПеренос Из Перенос Цикл
		Движение = Движения.СкладМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПеренос.Материал;
		Движение.Склад = СкладПриниматель;
		Движение.Количество = ТекСтрокаПеренос.Количество;
	КонецЦикла;

	// регистр СкладМатериалов Расход
	Движения.СкладМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПеренос Из Перенос Цикл
		Движение = Движения.СкладМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПеренос.Материал;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаПеренос.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

