
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Закупка") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаЗакупка Из ДанныеЗаполнения.Закупка Цикл
			НоваяСтрока = Себестоимость.Добавить();
			НоваяСтрока.Материал = ТекСтрокаЗакупка.Материал;
			НоваяСтрока.Сумма = ТекСтрокаЗакупка.Сумма;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполениеЭтапаПроизводства") Тогда
		// Заполнение шапки
		Номенклатура = ДанныеЗаполнения.Номенклатура;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетСебестоимости Приход
	Движения.РасчетСебестоимости.Записывать = Истина;
	Для Каждого ТекСтрокаСебестоимость Из Себестоимость Цикл
		Движение = Движения.РасчетСебестоимости.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материалы = ТекСтрокаСебестоимость.Материал;
		Движение.Номенклатура = Номенклатура;
		Движение.Трудозатраты = ТекСтрокаСебестоимость.ВидРаботы;
		Движение.Сумма = ТекСтрокаСебестоимость.Сумма;
		Движение.ТрудозатратыСумма = ТекСтрокаСебестоимость.Трудозатраты;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
