
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СкладМатериалов Приход
	Движения.СкладМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаЗакупка Из Закупка Цикл
		Движение = Движения.СкладМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗакупка.Материал;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаЗакупка.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



