
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполениеЭтапаПроизводства") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаЗатраченныеМатериалы Из ДанныеЗаполнения.ЗатраченныеМатериалы Цикл
			НоваяСтрока = СписокИзделий.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаЗатраченныеМатериалы.ЕдиницаИзмерения;
			НоваяСтрока.Номенклатура = ТекСтрокаЗатраченныеМатериалы.ЗатраченныеМатериалы;
			НоваяСтрока.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
