
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СкладГотовойПродукции Расход
	Движения.СкладГотовойПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаРеализация Из Реализация Цикл
		Движение = Движения.СкладГотовойПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРеализация.ГотоваяПродукция;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаРеализация.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
