&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНовостиССервера();
КонецПроцедуры

 &НаСервере
Процедура ОбновитьНовостиССервера()
	Попытка
		АдресСервера = ""; 
		СтрокаЗапроса = "/WEB/hs/services/tov";
		Соединение = Новый HTTPСоединение(АдресСервера);
		
		ЗапросПолучения = Новый HTTPЗапрос(СтрокаЗапроса);
		
		Ответ = Соединение.Получить(ЗапросПолучения); 
		
		Если Ответ.КодСостояния = 200 Тогда
			МассивНоменклатура = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
			Выборка = Справочники.Номенклатура.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектСправочника = Выборка.ПолучитьОбъект();
				ОбъектСправочника.Удалить();
			КонецЦикла;
			
			Для каждого НоменклатураИзМассива Из МассивНоменклатура Цикл
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				
				НоваяНоменклатура.Код = НоменклатураИзМассива.Код;  
				НоваяНоменклатура.Наименование = НоменклатураИзМассива.Наименование;
				НоваяНоменклатура.Тип = Перечисления.Тип[НоменклатураИзМассива.Тип];
				НоваяНоменклатура.ЕдиницаИзмерения = Перечисления.ЕдиницаИзмерения[НоменклатураИзМассива.ЕдиницаИзмерения];
				
				НоваяНоменклатура.Записать();
				
			КонецЦикла;

        Иначе
            Сообщить("Ошибка на стороне сервера: " + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;
    Исключение
        Сообщить("Ошибка соединения: " + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;       
	   
КонецПроцедуры
