&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)        
    ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;      
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;       
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ИтоговаяСумма = Объект.Номенклатура.Итог("Сумма");
КонецПроцедуры
