&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНовостиССервера();
КонецПроцедуры

 &НаСервере
Процедура ОбновитьНовостиССервера()
    Попытка
        АдресСервера = "192.168.0.150:8080"; 
        СтрокаЗапроса = "/WEB/hs/services/bri";
        Соединение = Новый HTTPСоединение(АдресСервера);
        
        ЗапросПолучения = Новый HTTPЗапрос(СтрокаЗапроса);
        Ответ = Соединение.Получить(ЗапросПолучения); 
        
        Если Ответ.КодСостояния = 200 Тогда
            МассивКорневыхБригад = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
            
            // Удаляем старые записи
            Выборка = Справочники.Рабочая_бригада.Выбрать();
            Пока Выборка.Следующий() Цикл
                ОбъектСправочника = Выборка.ПолучитьОбъект();
                ОбъектСправочника.Удалить();
            КонецЦикла;
            
            // Создаем все элементы рекурсивно
            Для каждого КорневаяБригада Из МассивКорневыхБригад Цикл
                СоздатьБригадуИПодчиненных(КорневаяБригада, Неопределено);
            КонецЦикла;
            
        Иначе
            Сообщить("Ошибка на стороне сервера: " + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;
        
    Исключение
        Сообщить("Ошибка соединения: " + Символы.ПС + ОписаниеОшибки());
    КонецПопытки;       
       
КонецПроцедуры

&НаСервере
Процедура СоздатьБригадуИПодчиненных(ДанныеБригады, Родитель)
    
    // Создаем бригаду
    Если ДанныеБригады.ЭтоГруппа Тогда
        НоваяБригада = Справочники.Рабочая_бригада.СоздатьГруппу();
    Иначе
        НоваяБригада = Справочники.Рабочая_бригада.СоздатьЭлемент();
    КонецЕсли;
    
    НоваяБригада.Наименование = ДанныеБригады.Наименование;
    НоваяБригада.Код = ДанныеБригады.Код;
    
    Если Родитель <> Неопределено Тогда
        НоваяБригада.Родитель = Родитель;
    КонецЕсли;
    
    НоваяБригада.Записать();
    
    // Создаем подчиненных
    Для каждого Подчиненный Из ДанныеБригады.Подчиненные Цикл
        СоздатьБригадуИПодчиненных(Подчиненный, НоваяБригада.Ссылка);
    КонецЦикла;
    
КонецПроцедуры
