
&НаКлиенте
АСИНХ Процедура АдресКартинкиВХНажатие(Элемент, СтандартнаяОбработка)
	АдресИОписаниеФайла = ЖДАТЬ ПолучитьАдресИОписаниеФайлаАсинх(ЭтотОбъект.УникальныйИдентификатор, Истина);
	ЭтотОбъект.АдресКартинкиВХ = АдресИОписаниеФайла.Адрес;
	ЭтотОбъект.РазмерФайла = АдресИОписаниеФайла.РазмерФайла;
	ЭтотОбъект.РасширениеФайла = АдресИОписаниеФайла.РасширениеФайла;
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Серверный.ЗаписатьКартинкуИзВХ(Объект.Ссылка, ЭтотОбъект.АдресКартинкиВХ, ЭтотОбъект.РазмерФайла, ЭтотОбъект.РасширениеФайла);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.АдресКартинкиВХ = Серверный.ПолучитьАдресКартинкиИзВХ(Объект.Ссылка, ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

