
&НаСервере
Процедура ДобавитьЗаписьНаСервере()
	ДанныеДляОтправки = Новый Структура;
	
	// Заполняем шапку документа
	ДанныеДляОтправки.Вставить("Дата", Строка(Объект.Дата));
	ДанныеДляОтправки.Вставить("Проведен", Строка(Объект.Проведен));
	ДанныеДляОтправки.Вставить("СкладОтправитель", Строка(Объект.СкладОтправитель));
	ДанныеДляОтправки.Вставить("СкладПриниматель", Строка(Объект.СкладПриниматель));
	
	МассивПереноса = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Объект.Перенос Цикл
        
        // Создаем структуру для одной строки
        Переносы = Новый Структура;
        
        // Вставляем поля по одному, а не через ЗаполнитьЗначенияСвойств
        Переносы.Вставить("Материал", Строка(СтрокаТЧ.Материал));
        Переносы.Вставить("Количество", Строка(СтрокаТЧ.Количество));
        
        // Добавляем в массив
        МассивПереноса.Добавить(Переносы);
    КонецЦикла;
    
    // Добавляем массив в структуру отправки
    ДанныеДляОтправки.Вставить("Перенос", МассивПереноса);
	
	JSON = ЗаписатьЗначениеJSON(ДанныеДляОтправки);
    
    // Для отладки - посмотрим что отправляем    
    // ========== ОТПРАВКА НА СЕРВЕР ==========
	Попытка
		АдресСервера = "192.168.0.150:8080";
		СтрокаЗапроса = "/WEB/hs/services/per";

        Соединение = Новый HTTPСоединение(АдресСервера);
        ЗапросHTTP = Новый HTTPЗапрос(СтрокаЗапроса);
        // Тело запроса
        ЗапросHTTP.УстановитьТелоИзСтроки(JSON);
        
        // Отправляем
        Ответ = Соединение.Записать(ЗапросHTTP);
		
        // Проверяем ответ
        Если Ответ.КодСостояния = 200 Тогда
            Сообщить("Документ успешно отправлен на сервер!");
        Иначе
            Сообщить("Ошибка на сервере (код " + Ответ.КодСостояния + "): " + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;
        
    Исключение
        Сообщить("Ошибка соединения: " + ОписаниеОшибки());
    КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗапись(Команда)
	ДобавитьЗаписьНаСервере();
КонецПроцедуры
