
&НаСервере
Процедура Выходное_изделиеПриИзмененииНаСервере()
	Если Объект.Выходное_изделие.Тип <> Перечисления.Тип.Полуфабрикат И Объект.Выходное_изделие.Тип <> Перечисления.Тип.Готовая_продукция 
		Тогда Сообщить("Выходное изделие может быть только полуфабрикатом или готовый изделием!");
		Объект.Выходное_изделие = Справочники.Номенклатура.ПустаяСсылка()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выходное_изделиеПриИзменении(Элемент)
	Выходное_изделиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МатериалыМатериалПриИзмененииНаСервере(ТекущаяСтрока)

	Если ТекущаяСтрока.Тип = Перечисления.Тип.Готовая_продукция 
		
		Тогда Сообщить("В качестве материала нельзя указать готовую продукцию!");
		
		ТекущаяСтрока = Справочники.Номенклатура.ПустаяСсылка()
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
		
	МатериалыМатериалПриИзмененииНаСервере(ТекущаяСтрока.Материал);
	
КонецПроцедуры

//&НаСервере
//Процедура МатериалыСпецификацияПриИзмененииНаСервере(ТекущаяСтрока)
//	
//	Если ТекущаяСтрока.Тип <> Перечисления.Тип.Полуфабрикат
//		
//		Тогда Сообщить("Спецификацию можно указать только для полуфабриката!");
//		
//		//ТекущаяСтрока = Справочники.Номеклатура.ПустаяСсылка()
//		//Справочники.Спецификации.Материалы.Спецификация = Неопределено;	
//	КонецЕсли;
//	
//КонецПроцедуры



&НаСервере
Функция  МатериалыСпецификацияПриИзмененииНаСервере(ТекущаяСтрока)
	
	Если ТекущаяСтрока.Тип <> Перечисления.Тип.Полуфабрикат
		
		Тогда Сообщить("Спецификацию можно указать только для полуфабриката!");
			Возврат Истина;
		Иначе
			Возврат Ложь;
		//ТекущаяСтрока = Справочники.Номеклатура.ПустаяСсылка()
		//Справочники.Спецификации.Материалы.Спецификация = Неопределено;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура МатериалыСпецификацияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	
	Результат = МатериалыСпецификацияПриИзмененииНаСервере(ТекущаяСтрока.Материал);
	
	Если Результат Тогда
		ТекущаяСтрока.Спецификация = Неопределено;
	КонецЕсли;

КонецПроцедуры
